# -*- coding: cp1251 -*-
# Запросити користувача створення списку
lst = input("Введіть список, розділений комами: ").split(",")

# Запросити користувача значення елементу
value = input("Введіть значення елементу, перед яким потрібно видалити: ")

# Знайти індекс елементу зі значенням, введеним користувачем
index = lst.index(value)

# Вилучити кожен елемент списку, який передує елементу зі значенням, введеним користувачем
lst = lst[index:]

# Вивести оновлений список
print("Оновлений список:", lst)
