# -*- coding: cp1251 -*-

# Запросити у користувача створення списку
lst = input("Введіть список елементів через кому: ").split(",")

# Ітерувати через список та перевірити, чи містить він пару елементів з однаковими значеннями
for i in range(len(lst)):
    for j in range(i+1, len(lst)):
        if lst[i] == lst[j]:
            print("Список містить пару елементів з однаковими значеннями.")
            break
    else:
        continue
    break
else:
    print("Список не містить пару елементів з однаковими значеннями.")
